app/Controllers/ProductController.php

    public function fetchProducts()
    {
        $product = new ProductModel();
        $data['products'] = $product->findAll();
---
SELECT *
FROM `tbl_products`