app/Controllers/StudentController.php

    public function postData()
    {
        $students = new StudentModel();
        $data = [
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
            'phone' => $this->request->getPost('phone'),
            'course' => $this->request->getPost('course')
        ];
        $students->save($data);
        return redirect("students")->with('status', 'Student Inserted Successfully');
---
INSERT INTO `tbl_students` (`name`, `email`, `phone`, `course`) VALUES ('swiss', 'smartr@gmail.com', '+2541245788554', 'WordPress')
SELECT *
FROM `tbl_students`

    public function fetchData()
    {
        $student = new StudentModel();
        $data['students'] = $student->findAll();
---
SELECT *
FROM `tbl_students`

    public function editData($id = null)
    {
        $student = new StudentModel();
        $data['student'] = $student->find($id);
---
SELECT *
FROM `tbl_students`
WHERE `tbl_students`.`id` = '12'

    public function delete($id = null)
    {
        $student = new StudentModel();
        $student->delete($id);
---
DELETE FROM `tbl_students`
WHERE `id` IN ('12')

    public function confirmDelete($id = null)
    {
        $student = new StudentModel();
        $student->delete($id);
---
DELETE FROM `tbl_students`
WHERE `id` IN ('15')